---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.OnShutdownEO
source: html/6ab1c3be-aaf2-1fbc-48d6-5edc1c13a391.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.OnShutdownEO Method

For Revit Macros internal use only.

## Syntax (C#)
```csharp
public void OnShutdownEO()
```